tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/lastruns/symm8/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
27222
(
(7.89824 0.118949 0)
(7.91621 0.11447 9.37567e-25)
(7.86428 0.0519705 -4.26041e-24)
(7.93828 0.0591397 0)
(7.9032 0.0752105 2.57498e-23)
(7.87245 0.0749678 3.32408e-23)
(7.92559 0.0484066 4.60084e-24)
(7.95017 0.0673739 0)
...
)
;

boundaryField
{
    airfoil
    {
        type            noSlip;
    }
    freestream
    {
        type            freestreamVelocity;
        freestreamValue uniform (8 0 0);
        value           uniform (8 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
