tutorials/incompressible/pimpleRemeshFoam/cavitation_flapped/lastruns/symm8/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
27222
(
0.000578809
0.000573131
0.000597109
0.000584785
0.000559855
0.000611414
0.000600278
0.000579886
...
)
;

boundaryField
{
    airfoil
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
    freestream
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.005;
        value           uniform 0.005;
    }
    outlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.005;
        value           uniform 0.005;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
